app/Controllers/komik.php

    public function delete($id)
    {
        $data = [
            'title' => 'Delete data Komik'
        ];
        $this->m_komik->delete($id);
---
DELETE FROM `komik`
WHERE `id` IN ('43')