app/Models/m_komik.php

SELECT *
FROM `komik`
SELECT *
FROM `komik`
WHERE `slug` = '3'
 LIMIT 1
---
    public function getdata($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();